nguyentri/da-pac/svd/DA14586.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ambacore580_patch_gr00</name>
      <version>1.0</version>
      <description>ambacore580_patch_gr00 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x40008400</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>80</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PATCH_ADDR0_REG</name>
          <description>Patch entry 0: Address field</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_ADDR</name>
              <description>This is the value which will be compared to the address on the AHB. If a match occurs, the data bus willl be filled with the value in the respective PATCH_DATAx_REG. Bits [1:0] are read-only and always read as '0'.
Never use the base address 0x0 for values in PATCH_ADDRx_REG because HW Patch block is located after the Address Remapping block. </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_ADDR1_REG</name>
          <description>Patch entry 1: Address field</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_ADDR</name>
              <description>This is the value which will be compared to the address on the AHB. If a match occurs, the data bus willl be filled with the value in the respective PATCH_DATAx_REG. Bits [1:0] are read-only and always read as '0'.
Never use the base address 0x0 for values in PATCH_ADDRx_REG because HW Patch block is located after the Address Remapping block. </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_ADDR2_REG</name>
          <description>Patch entry 2: Address field</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_ADDR</name>
              <description>This is the value which will be compared to the address on the AHB. If a match occurs, the data bus willl be filled with the value in the respective PATCH_DATAx_REG. Bits [1:0] are read-only and always read as '0'.
Never use the base address 0x0 for values in PATCH_ADDRx_REG because HW Patch block is located after the Address Remapping block. </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_ADDR3_REG</name>
          <description>Patch entry 3: Address field</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_ADDR</name>
              <description>This is the value which will be compared to the address on the AHB. If a match occurs, the data bus willl be filled with the value in the respective PATCH_DATAx_REG. Bits [1:0] are read-only and always read as '0'.
Never use the base address 0x0 for values in PATCH_ADDRx_REG because HW Patch block is located after the Address Remapping block. </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_ADDR4_REG</name>
          <description>Patch entry 4: Address field</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_ADDR</name>
              <description>This is the value which will be compared to the address on the AHB. If a match occurs, the data bus willl be filled with the value in the respective PATCH_DATAx_REG. Bits [1:0] are read-only and always read as '0'.
Never use the base address 0x0 for values in PATCH_ADDRx_REG because HW Patch block is located after the Address Remapping block. </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_ADDR5_REG</name>
          <description>Patch entry 5: Address field</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_ADDR</name>
              <description>This is the value which will be compared to the address on the AHB. If a match occurs, the data bus willl be filled with the value in the respective PATCH_DATAx_REG. Bits [1:0] are read-only and always read as '0'.
Never use the base address 0x0 for values in PATCH_ADDRx_REG because HW Patch block is located after the Address Remapping block. </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_ADDR6_REG</name>
          <description>Patch entry 6: Address field</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_ADDR</name>
              <description>This is the value which will be compared to the address on the AHB. If a match occurs, the data bus willl be filled with the value in the respective PATCH_DATAx_REG. Bits [1:0] are read-only and always read as '0'.
Never use the base address 0x0 for values in PATCH_ADDRx_REG because HW Patch block is located after the Address Remapping block. </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_ADDR7_REG</name>
          <description>Patch entry 7: Address field</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_ADDR</name>
              <description>This is the value which will be compared to the address on the AHB. If a match occurs, the data bus willl be filled with the value in the respective PATCH_DATAx_REG. Bits [1:0] are read-only and always read as '0'.
Never use the base address 0x0 for values in PATCH_ADDRx_REG because HW Patch block is located after the Address Remapping block. </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_DATA0_REG</name>
          <description>Patch entry 0: Data field</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_DATA</name>
              <description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_DATA1_REG</name>
          <description>Patch entry 1: Data field</description>
          <addressOffset>0x0000001c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_DATA</name>
              <description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_DATA2_REG</name>
          <description>Patch entry 2: Data field</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_DATA</name>
              <description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_DATA3_REG</name>
          <description>Patch entry 3: Data field</description>
          <addressOffset>0x0000002c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_DATA</name>
              <description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_DATA4_REG</name>
          <description>Patch entry 4: Data field</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_DATA</name>
              <description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_DATA5_REG</name>
          <description>Patch entry 5: Data field</description>
          <addressOffset>0x0000003c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_DATA</name>
              <description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_DATA6_REG</name>
          <description>Patch entry 6: Data field</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_DATA</name>
              <description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_DATA7_REG</name>
          <description>Patch entry 7: Data field</description>
          <addressOffset>0x0000004c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_DATA</name>
              <description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_VALID_REG</name>
          <description>Validity Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_VALID</name>
              <description>Indicates which patch entry is valid. For example, when bit 0 is high it indicates that entry 0 is valid, i.e. the values of PATCH_ADDR0_REG / PATCH_DATA0_REG, are effective. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_VALID_RESET_REG</name>
          <description>Validity Reset Control Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_VALID_RESET</name>
              <description>Writing a bit with 1 will clear the corresponding bit of PATCH_VALID_REG to 0. Writing a bit with zero is ignored. Read always as 0. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_VALID_SET_REG</name>
          <description>Validity Set Control Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PATCH_VALID_SET</name>
              <description>Writing a bit with 1 will set the corresponding bit of PATCH_VALID_REG to 1. Writing a bit with 0 is ignored.
Read always as 0. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
