nguyentri/da-pac/svd/DA14586.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>anamisc580_nl01</name>
      <version>1.0</version>
      <description>anamisc580_nl01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50001600</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK_REF_CNT_REG</name>
          <description>Count value for oscillator calibration</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>REF_CNT_VAL</name>
              <description>Indicates the calibration time, with a decrement counter to 1. </description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_REF_SEL_REG</name>
          <description>Select clock for oscillator calibration</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>REF_CAL_START</name>
              <description>Writing a '1' starts a calibration. This bit is cleared when calibration is finished, and CLK_REF_VAL is ready. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_CLK_SEL</name>
              <description>Select clock input for calibration:
0x0 : RC32K oscillator
0x1 : RC16M oscillator
0x2 : XTAL32K oscillator
0x3 : RCX oscillator</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_REF_VAL_H_REG</name>
          <description>XTAL16M reference cycles, upper 16 bits</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>XTAL_CNT_VAL</name>
              <description>Returns the upper 16 bits of XTAL16 clock cycles during the calibration time, defined with REF_CNT_VAL </description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_REF_VAL_L_REG</name>
          <description>XTAL16M reference cycles, lower 16 bits</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>XTAL_CNT_VAL</name>
              <description>Returns the lower 16 bits of XTAL16 clock cycles during the calibration time, defined with REF_CNT_VAL </description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ble580_gr01</name>
      <version>1.0</version>
      <description>ble580_gr01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>520</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BLE_ACTSCANSTAT_REG</name>
          <description>Active scan register</description>
          <addressOffset>0x000000a4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>BACKOFF</name>
              <description>Active scan mode back-off counter initialization value. </description>
              <bitRange>[24:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPPERLIMIT</name>
              <description>Active scan mode upper limit counter value. </description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_ADVCHMAP_REG</name>
          <description>Advertising Channel Map</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>ADVCHMAP</name>
              <description>Advertising Channel Map, defined as per the advertising connection settings. Contains advertising channels index 37 to 39. If ADVCHMAP[i] equals:
0: Do not use data channel i+37.
1: Use data channel i+37. </description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_ADVTIM_REG</name>
          <description>Advertising Packet Interval</description>
          <addressOffset>0x000000a0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>ADVINT</name>
              <description>Advertising Packet Interval defines the time interval in between two ADV_xxx packet sent.
Value is in usec.
Value to program depends of the used Advertising Packet type and the device filtering policy. Please refer to Table 3-10 for details about ADVINT programming range. </description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_AESCNTL_REG</name>
          <description>Start AES register</description>
          <addressOffset>0x000000c0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>AES_START</name>
              <description>Writing a 1 starts AES-128 ciphering process.
This bit is reset once the process is finished (i.e BLE_CRYPT_IRQ interrupt occurs, even masked) </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_AESKEY127_96_REG</name>
          <description>AES encryption key</description>
          <addressOffset>0x000000d0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>AESKEY127_96</name>
              <description>AES encryption 128-bit key. Bit 127 down to 96 </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_AESKEY31_0_REG</name>
          <description>AES encryption key</description>
          <addressOffset>0x000000c4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>AESKEY31_0</name>
              <description>AES encryption 128-bit key. Bit 31 down to 0 </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_AESKEY63_32_REG</name>
          <description>AES encryption key</description>
          <addressOffset>0x000000c8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>AESKEY63_32</name>
              <description>AES encryption 128-bit key. Bit 63 down to 32 </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_AESKEY95_64_REG</name>
          <description>AES encryption key</description>
          <addressOffset>0x000000cc</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>AESKEY95_64</name>
              <description>AES encryption 128-bit key. Bit 95 down to 64 </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_AESPTR_REG</name>
          <description>Pointer to the block to encrypt/decrypt</description>
          <addressOffset>0x000000d4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>AESPTR</name>
              <description>Pointer to the memory zone where the block to encrypt/decrypt is stored. </description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_BASETIMECNTCORR_REG</name>
          <description>Base Time Counter</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>BASETIMECNTCORR</name>
              <description>Base Time Counter correction value. </description>
              <bitRange>[26:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_BASETIMECNT_REG</name>
          <description>Base time reference counter</description>
          <addressOffset>0x0000001c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>BASETIMECNT</name>
              <description>Value of the 625us base time reference counter. Updated each time BLE_SAMPLECLK_REG[SAMP] is written. Used by the SW in order to synchronize with the HW. </description>
              <bitRange>[26:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_BDADDRL_REG</name>
          <description>BLE device address LSB register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>BDADDRL</name>
              <description>Bluetooth Low Energy Device Address. LSB part. </description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_BDADDRU_REG</name>
          <description>BLE device address MSB register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>PRIV_NPUB</name>
              <description>Bluetooth Low Energy Device Address privacy indicator
0: Public Bluetooth Device Address
1: Private Bluetooth Device Address </description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDADDRU</name>
              <description>Bluetooth Low Energy Device Address. MSB part. </description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_CNTL2_REG</name>
          <description>BLE Control Register 2</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>BLE_RSSI_SEL</name>
              <description>0: Select Peak-hold RSSI value (default).
1: Select current Average RSSI value. </description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUPLPSTAT</name>
              <description>The status of the BLE_WAKEUP_LP_IRQ. The Interrupt Service Routine of BLE_WAKEUP_LP_IRQ should return only when the WAKEUPLPSTAT is cleared.
						Note that BLE_WAKEUP_LP_IRQ is automatically acknowledged after the power up of the Radio Subsystem, plus one Low Power Clock period. </description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SW_RPL_SPI</name>
              <description>Keep to 0. </description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_ONLY</name>
              <description>Keep to 0. </description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_ONLY</name>
              <description>Keep to 0. </description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_CLK_SEL</name>
              <description>BLE Clock Select.
Specifies the BLE master clock absolute frequency in MHz.
Typical values are 16 and 8.
Value depends on the selected XTAL frequency and the value of CLK_RADIO_REG[BLE_DIV] bitfield. For example, if XTAL oscillates at 16MHz and CLK_RADIO_REG[BLE_DIV] = 1 (divide by 2), then BLE master clock frequency is 8MHz and BLE_CLK_SEL should be set to value 8.
The selected BLE master clock frequency (affected by BLE_DIV and BLE_CLK_SEL) must be modified and set only during the initialization time, i.e. before setting BLE_RWBTLECNTL_REG[RWBLE_EN] to 1.
Refer also to BLE_RWBTLECONF_REG[CLK_SEL].</description>
              <bitRange>[14:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_PWRDN_ALLOW</name>
              <description>This active high signal indicates when it is allowed for the BLE core (embedded in the Radio sub-System power domain) to be powered down.
After the assertion of the BLE_DEEPSLCNTL_REG[DEEP_SLEEP_ON] a hardware sequence based on the Low Power clock will cause the assertion of RADIO_PWRDN_ALLOW. The RADIO_PWRDN_ALLOW will be cleared to '0' when the BLE core exits from the sleep state, i.e. when the BLE_SLP_IRQ will be asserted.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MON_LP_CLK</name>
              <description>The SW can only write a '0' to this bit.
Whenever a positive edge of the low power clock used by the BLE Timers is detected, then the HW will automatically set this bit to '1'. This functionality will not work if BLE Timer is in reset state (refer to CLK_RADIO_REG[BLE_LP_RESET]).
This bit can be used for SW synchronization, to debug the low power clock, etc.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_CLK_STAT</name>
              <description>0: BLE uses low power clock
1: BLE uses master clock </description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DIAGPORT_REVERSE</name>
              <description>BLE/RADIO Diagnostic Port Reverse order.
When this bit is '1', the mapping of the diagnostic bus DIAGPORT[7:0] (controlled by DIAGPORT_SEL) to GPIOs (controlled by Pxy_MODE_REG[PID]) is reversed. The mapping is:
If '0' then DIAGPORT[7] is mapped to P0[7], etc.
DIAGPORT[4] is mapped to P0[4],
DIAGPORT[3] is mapped to P0[3] and P1[3], etc. and
DIAGPORT[0] is mapped to P0[0] and P1[0].

If '1' then DIAGPORT[7] is mapped to P0[0] and P1[0], etc.
DIAGPORT[4] is mapped to P0[3] and P1[3],
DIAGPORT[3] is mapped to P0[4], etc. and
DIAGPORT[0] is mapped to P0[7].</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGPORT_SEL</name>
              <description>BLE/RADIO Diagnostic Port Selection.
Controls the multiplexing of the internal diagnostic signals towards the 8-bit diagnostic bus DIAGPORT[7:0]. The DIAGPORT[7:0] bit order may or may not be reversed by using the DIAGPORT_REVERSE bitfield and then it will be directed to the GPIOs P0[7:0] and P1[3:0]. (Note that the P1[3:0] diagnostic signals are the same with P0[3:0] signals.)
The DIAGPORT[7:0] value, depending on the DIAGPORT_SEL value, is:
00: {BLE_DIAG2[7:5], BLE_DIAG1[4:3], BLE_DIAG0[2:0]}
01: {BLE_DIAG2[7:5], BLE_DIAG1[4:3], BLE_DIAG0[2]
, wakeup_lp_irq, deep_sleep_stat_32k}
10: RADIO_DIAG0[7:0]
11: RADIO_DIAG1[7:0]</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EMACCERRMSK</name>
              <description>Exchange Memory Access Error Mask:
When cleared to '0' the EM_ACC_ERR will not cause an BLE_ERROR_IRQ interrupt.
When set to '1' an BLE_ERROR_IRQ will be generated as long as EM_ACC_ERR is '1'. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EMACCERRACK</name>
              <description>Exchange Memory Access Error Acknowledge.
When the SW writes a '1' to this bit then the EMACCERRSTAT bit will be cleared.
When the SW writes '0' it will have no affect.
The read value is always '0'. </description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>EMACCERRSTAT</name>
              <description>Exchange Memory Access Error Status:
The bit is read-only and can be cleared only by writing a '1' at EMACCERRACK bitfield.
This bit will be set to '1' by the hardware when the controller will access an EM page that is not mapped according to the EM_MAPPING value.
When this bit is '1' then the BLE_ERROR_IRQ will be asserted as long as EMACCERRMSK is '1'. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_CURRENTRXDESCPTR_REG</name>
          <description>Rx Descriptor Pointer for the Receive Buffer Chained List</description>
          <addressOffset>0x0000002c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>CURRENTRXDESCPTR</name>
              <description>Rx Descriptor Pointer that determines the starting point of the Receive Buffer Chained List. </description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_DEBUGADDMAX_REG</name>
          <description>Upper limit for the memory zone</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>ADDMAX</name>
              <description>Upper limit for the memory zone. </description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_DEBUGADDMIN_REG</name>
          <description>Lower limit for the memory zone</description>
          <addressOffset>0x0000005c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>ADDMIN</name>
              <description>Lower limit for the memory zone. </description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
