nguyentri/da-pac/svd/DA14586.svd
        <register>
          <name>P37_MODE_REG</name>
          <description>P37 Mode Register</description>
          <addressOffset>0x00000094</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PUPD</name>
              <description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, Pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>See P0x_MODE_REG[PID] </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3_DATA_REG</name>
          <description>P3 Data input / output register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P3_DATA</name>
              <description>Set P3 output register when written; Returns the value of P3 port when read </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3_PADPWR_CTRL_REG</name>
          <description>Port 3 Output Power Control Register</description>
          <addressOffset>0x00000074</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P3_OUT_CTRL</name>
              <description>1 = P3_x port output is powered by the 1 V rail
0 = P3_x port output is powered by the 3 V rail
bit 0 controls the power of P3[0],
bit 7 controls the power of P3[7],</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3_RESET_DATA_REG</name>
          <description>P3 Reset port pins register</description>
          <addressOffset>0x00000084</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P3_RESET</name>
              <description>Writing a 1 to P0[y] sets P0[y] to 0. Writing 0 is discarded;
Reading returns 0</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3_SET_DATA_REG</name>
          <description>P3 Set port pins register</description>
          <addressOffset>0x00000082</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>P3_SET</name>
              <description>Writing a 1 to P3[y] sets P3[y] to 1. Writing 0 is discarded; Reading returns 0</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMBIST_RESULTH_REG</name>
          <addressOffset>0x000000fe</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>ROMBIST_RESULTH</name>
              <description>Read version of bist status, result[31:16] </description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMBIST_RESULTL_REG</name>
          <addressOffset>0x000000fc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>ROMBIST_RESULTL</name>
              <description>Read version of bist status, result[15:0] </description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_CTRL2_REG</name>
          <addressOffset>0x000000f2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RF_IN_TESTMUX_CTRL</name>
              <description>CConnect the RF input testbus to pins </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ANA_TESTMUX_CTRL</name>
              <description>Control of analog test bus switches:
0: all switches open
1: only switch 1 closed
2: only switch 2 closed
3: only switch 3 closed
4: only switch 4 closed
5: switches 1 &amp; 2 closed
6: switches 1 &amp; 4 closed
7: switches 2 &amp; 3 closed
8: switches 3 &amp; 4 closed </description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_CTRL3_REG</name>
          <addressOffset>0x000000f4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RF_TEST_OUT_PARAM</name>
              <description>Select which test will be enabled on the block selected by the RF output testbus (see </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_TEST_OUT_SEL</name>
              <description>Select a radio block to have its testbus connected to P1[1] and P1[2]. See
Table 7
for more information.
NOTE: all 0 represent no testmode and the testbusses are shorted to ground to prevent floating busses. </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_CTRL4_REG</name>
          <addressOffset>0x000000f6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RF_TEST_IN_PARAM</name>
              <description>Select which test will be enabled on the block selected by the RF output testbus (see </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_TEST_IN_SEL</name>
              <description>Select an RF block to have its test input connected to the input testbus at pins P0[0] and P0[3]. NOTE: all 0 represent no testmode and the testbusses are shorted to ground to prevent floating busses. </description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_CTRL5_REG</name>
          <addressOffset>0x000000f8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>DCDC_FORCE_IDLE</name>
              <description>Keep the DCDC-converter in the idle state. </description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_OUTSW</name>
              <description>Close pMOS switch between 'switch' and 'vdcdc' </description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_PSW</name>
              <description>Close pMOS switch between 'switch' and 'vbat3v' </description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_NSW</name>
              <description>Close nMOS switch between 'switch' and 'gnd' </description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_STRUCT</name>
              <description>4 bits to select which test-structure is mapped on P1[1]
0 : open
1 : VDD (1.2V)
2 : 10uA into 66k = 5/3 x 40k (W/L=0.45/22.33)
3 : 1uA into 700k = 18.5 x 40k (W/L=0.45/22.33)
4 : 1uA(same as going into 700k)
5 : AVS (0V)
6 : 5uA into nMOST (svt) 2x1u/110n
7 : 5uA into nMOST (hvt) 2x1u/110n
8 : 5uA into nMOST (UD18) 2x1u/260n
9 : 5uA into nMOST (OD33) 2x1u/500n
a : 7.5uA into nMOST (na25) 4x1u/1.2u
b : 5uA into nMOST (0vt) 4x1u/300n
c : VDD - 5uA from pMOST (svt) 2x1u/110n
d : VDD - 5uA from pMOST (hvt) 2x1u/110n
e : VDD - 5uA from pMOST (OD33) 2x1u/400n
f : VDD - 5uA from pMOST (UD18) 2x1u/260n </description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_OTP_VSS</name>
              <description>VSS_OTP (0V) mapped on P1[2] </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_OTP_OTA</name>
              <description>Output of OTA inside LDO-OTP is mapped on P1[2]. This voltage will slowely rise due to capacitor leakage. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_OTP_VDD</name>
              <description>VDD_OTP on P1[2], 1uA bias sink on P1[1] </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_VDD</name>
              <description>VDD on P1[1], VDD_REF (=ADC) on P1[2] </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_CTRL_REG</name>
          <addressOffset>0x000000f0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PLL_TST_MODE</name>
              <description>0: Normal operation
1: Show the PLL test mode signals:
P0[0] = RCLK
P0[1] = NCLK
P0[2] = CP_UP
P0[3] = CP_DOWN
Notes:
- The control signal should go to the radio to enable this test mode. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHOW_IF_RO</name>
              <description>0: Normal Port function.
1: Show IF filter Reference Oscillator I and Q signals.
P0[0] = iff_ro_out_i
P0[1] = iff_ro_out_q </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL16M_CAP_TEST_EN</name>
              <description>0: Normal Port function.
1: Show xtal16m_cap_test_outoutput P1[2:1]
Notes:
- The control signal should go to the radio to enable this test mode.
- This register should be zero during scan test! </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHOW_DC_COMP</name>
              <description>0: normal port function
1: show signals to evaluate comparators in DCDC converter: P1[3:1] = dyn_sw_n[2:0]P1[0],P0[7:6] = dyn_sw[2:0]P0[5:3] = cont_sw[2:0] P0[2:0] = dcdc_test_out[2:0] (2=swout, 1=swp, 0=swn) </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHOW_DC_STATE</name>
              <description>0: normal port function
1: show signals to debug/evaluate the DCDC converter: P1[3] = ldo_dig_okP1[2] = ldo_otp_ok P1[1] = dcdc_idleP1[0] = dcdc_clk P0[7] = boost_vbat_ok P0[6] = vdcdc_okP0[5:0] = dcdc_test_out[5:0]
(5=short, 4=bypass, 3=sw1v, 2=swout, 1=swp, 0=swn) </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_RFPT</name>
              <description>0: normal port function
1: enable the RF Production Test Unit. Used to store RX ADC samples or PLL TDC samples in SRAM.
See RFPT_CTRL_REG, RFPT_ADDR_REG and RFPT_LEN_REG for details. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHOW_CLOCKS</name>
              <description>0: normal port function
1: P0[5] = XTAL16M_clk
P0[6] = XTAL32K_clk
P0[7] = RC16M_clk
P1[0] = RC32K_clk
P1[1] = RC32K_Low_Jitter_clk</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
