nguyentri/da-pac/svd/DA14586.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>r_rfcu580_nl01</name>
      <version>1.0</version>
      <description>r_rfcu580_nl01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50002000</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>3186</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BIAS_CTRL1_REG</name>
          <addressOffset>0x00000600</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00008888</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>IFF_BIAS_SET</name>
              <description>Tuning of the IF filter bias current </description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_BIAS_SET</name>
              <description>Tuning of the VCO bias current </description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP_BIAS_SET</name>
              <description>Tuning of the charge pump bias current </description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIX_BIAS_SET</name>
              <description>Tuning of the mixer bias current </description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ADCI_DC_OFFSET_REG</name>
          <description>Must be Retained</description>
          <addressOffset>0x00000310</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00008080</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>ADC_OFFN_I_RD</name>
              <description>DC offset compensation in the I path (inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_OFFP_I_RD</name>
              <description>DC offset compensation in the I path (non-inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ADCQ_DC_OFFSET_REG</name>
          <description>Must be Retained</description>
          <addressOffset>0x00000312</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00008080</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>ADC_OFFN_Q_RD</name>
              <description>DC offset compensation in the Q path (inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_OFFP_Q_RD</name>
              <description>DC offset compensation in the Q path (non-inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ADC_CTRL1_REG</name>
          <addressOffset>0x00000830</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>ADC_SIGN</name>
              <description>Change polarity of ADC input. </description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_MUTE</name>
              <description>0: Normal operation
1: Short the inputs of the ADC (used for DC offset cal) </description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DC_OFFSET_SEL</name>
              <description>0: Normal operation (i.e. Use automatically calibrated value)
1: Use ADC_OFFx_y_WR to set the DC offset compensation values in the ADC (x = N or P, y = I or Q </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ADC_CTRL2_REG</name>
          <addressOffset>0x00000832</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>ADC_OFFN_I_WR</name>
              <description>External value for the DC offset compensation in the I path negative side. With common mode input voltage at Vpwrp/2, this value is 512-ADC_OFFP_Q_WR. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_OFFP_I_WR</name>
              <description>External value for the DC offset compensation in the I path positive side. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ADC_CTRL3_REG</name>
          <addressOffset>0x00000834</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>ADC_OFFN_Q_WR</name>
              <description>External value for the DC offset compensation in the Q path negative side. With common mode input voltage at Vpwrp/2, this value is 512-ADC_OFFP_Q_WR. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_OFFP_Q_WR</name>
              <description>External value for the DC offset compensation in the Q path positive side. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_AFC_CTRL_REG</name>
          <addressOffset>0x00000864</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x000000f5</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>POLE2</name>
              <description>Choose the method to use for AFC tracking during the slot
Description TBD </description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POLE1</name>
              <description>Choose the method to use for AFC tracking during the slot
Description TBD </description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AFC_MODE</name>
              <description>Choose the method to use for AFC tracking during the slot
Description TBD </description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_AGC_CTRL1_REG</name>
          <addressOffset>0x00000860</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000980b</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>AGC_MODE</name>
              <description>Choose the method to use for AGC evaluation
Description TBD </description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_TH_HIGH</name>
              <description>AGC hysteresis high threshold (switch up one AGC_SETTING_R step when exceeding this level) </description>
              <bitRange>[13:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_TH_LOW</name>
              <description>AGC hysteresis low threshold (switch down one AGC_SETTING_R step when dropping below this level) </description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_AGC_CTRL2_REG</name>
          <addressOffset>0x00000862</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>SLOW_AGC</name>
              <description>Enable the slow AGC mode (no consecutive AGC setting switches) </description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AGCSETTING_WR</name>
              <description>Fixed AGC setting to be used to configure LNA, VGA1 and VGA2 when AGCSETTING_SEL = 1
0: Highest gain as configured in RF_AGC_LUT_01_REG
1: Lower gain as configured in RF_AGC_LUT_01_REG
2: Still lower gain as configured in RF_AGC_LUT_23_REG
...
9-F: Lowest gain as configured in RF_AGC_LUT_89_REG </description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AGCSETTING_SEL</name>
              <description>LNA, VGA1 and VGA2 gains
'0': controlled by AGC'1': provided manually through AGCSETTING_WR </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_FRZ_GAIN</name>
              <description>'0': AGC always active'1': Freeze gain after Access Address detection </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_TH</name>
              <description>RSSI threshold for the packet detection </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_AGC_LUT_01_REG</name>
          <addressOffset>0x00000850</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN1</name>
              <description>LNA gain setting while in AGC setting 0 </description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA1_GAIN1</name>
              <description>VGA1 gain setting while in AGC setting 1 </description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA2_GAIN1</name>
              <description>VGA2 gain setting while in AGC setting 1 </description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN0</name>
              <description>LNA gain setting while in AGC setting 0 </description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA1_GAIN0</name>
              <description>VGA1 gain setting while in AGC setting 0 </description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA2_GAIN0</name>
              <description>VGA2 gain setting while in AGC setting 0 </description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_AGC_LUT_23_REG</name>
          <addressOffset>0x00000852</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000909</resetValue>
          <resetMask>0x00003f3f</resetMask>
          <fields>
            <field>
              <name>VGA1_GAIN3</name>
              <description>VGA1 gain setting while in AGC setting 3 </description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA2_GAIN3</name>
              <description>VGA2 gain setting while in AGC setting 3 </description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA1_GAIN2</name>
              <description>VGA1 gain setting while in AGC setting 2 </description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA2_GAIN2</name>
              <description>VGA2 gain setting while in AGC setting 2 </description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_AGC_LUT_45_REG</name>
          <addressOffset>0x00000854</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00004b4a</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN5</name>
              <description>LNA gain setting while in AGC setting 5 </description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA1_GAIN5</name>
              <description>VGA1 gain setting while in AGC setting 5 </description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA2_GAIN5</name>
              <description>VGA2 gain setting while in AGC setting 5 </description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN4</name>
              <description>LNA gain setting while in AGC setting 4 </description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA1_GAIN4</name>
              <description>VGA1 gain setting while in AGC setting 4 </description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA2_GAIN4</name>
              <description>VGA2 gain setting while in AGC setting 4 </description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_AGC_LUT_67_REG</name>
          <addressOffset>0x00000856</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00005b53</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN7</name>
              <description>LNA gain setting while in AGC setting 7 </description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA1_GAIN7</name>
              <description>VGA1 gain setting while in AGC setting 7 </description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA2_GAIN7</name>
              <description>VGA2 gain setting while in AGC setting 7 </description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN6</name>
              <description>LNA gain setting while in AGC setting 6 </description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA1_GAIN6</name>
              <description>VGA1 gain setting while in AGC setting 6 </description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA2_GAIN6</name>
              <description>VGA2 gain setting while in AGC setting 6 </description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_AGC_LUT_89_REG</name>
          <addressOffset>0x00000858</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00006b63</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN9</name>
              <description>LNA gain setting while in AGC setting 9 </description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA1_GAIN9</name>
              <description>VGA1 gain setting while in AGC setting 9 </description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA2_GAIN9</name>
              <description>VGA2 gain setting while in AGC setting 9 </description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN8</name>
              <description>LNA gain setting while in AGC setting 8 </description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA1_GAIN8</name>
              <description>VGA1 gain setting while in AGC setting 8 </description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VGA2_GAIN8</name>
              <description>VGA2 gain setting while in AGC setting 8 </description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_AGC_RESULT_REG</name>
          <addressOffset>0x00000900</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>AGCSETTING_RD</name>
              <description>AGC setting as automatically selected in receive mode to configure LNA, VGA1 and VGA2
0: Highest gain as configured in RF_AGC_LUT_01_REG
1: Lower gain as configured in RF_AGC_LUT_01_REG
2: Still lower gain as configured in RF_AGC_LUT_23_REG
...
9-F: Lowest gain as configured in RF_AGC_LUT_89_REG </description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AFC_RD</name>
              <description>Frequency offset estimation (in 2s complement) with a resolution of approximately 5 kHz. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_BMCW_REG</name>
          <description>Changed functionality of bits [7:6]</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>CN_SEL</name>
              <description>Select between:
1 = use CN_WR as channel number
0 = use BLE Frequency word (normal function). </description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CN_WR</name>
              <description>[7:6] = offset to RFCAL_CAP_WR, coarse calibraton LUT
[5:0] = channel number</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CALCAP1_REG</name>
          <addressOffset>0x00000060</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>VCO_CALCAP_LOW</name>
              <description>Lowest 16 bits of vco_calcap </description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CALCAP2_REG</name>
          <addressOffset>0x00000062</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>VCO_CALCAP_HIGH</name>
              <description>Highest 2 bits of vco_calcap. </description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CALSTATE_REG</name>
          <addressOffset>0x00000040</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>CALSTATE</name>
              <description>Value of the calstate state machine </description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
