nguyentri/da-pac/svd/DA14586.svd
        <register>
          <name>RF_CAL_CTRL_REG</name>
          <addressOffset>0x00000200</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>VCO_CAL_DIS</name>
              <description>Do not calibrate the VCO during Cal cycle </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_OFFSET_CAL_DIS</name>
              <description>Do not calibrate the VGA2 Offset during Cal cycle </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IFF_CAL_DIS</name>
              <description>Do not calibrate the IFF center frequency during Cal cycle </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MGAIN_CAL_DIS</name>
              <description>Do not calibrate the VCO and Modulation Gain during Cal cycle </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EO_CAL</name>
              <description>End of calibration trigger.
Reading returns the eo_cal status signal which can be cleared by writing to RF_IRQ_CTRL_REG.EO_CAL_CLEAR </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SO_CAL</name>
              <description>Start of calibration trigger.Writing a 1 starts calibration.1Reading returns the calibration status (1 = busy calibrating). </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_10_REG</name>
          <addressOffset>0x00000512</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000022a</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_11_REG</name>
          <addressOffset>0x00000514</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000234</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_tx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_tx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_12_REG</name>
          <addressOffset>0x00000516</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000023c</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_13_REG</name>
          <addressOffset>0x00000518</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_14_REG</name>
          <addressOffset>0x0000051a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_1_REG</name>
          <addressOffset>0x00000500</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000800</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/so_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_2_REG</name>
          <addressOffset>0x00000502</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000508</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/so_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_3_REG</name>
          <addressOffset>0x00000504</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000210</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/so_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_4_REG</name>
          <addressOffset>0x00000506</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000022a</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_5_REG</name>
          <addressOffset>0x00000508</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000218</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_6_REG</name>
          <addressOffset>0x0000050a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000232</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_7_REG</name>
          <addressOffset>0x0000050c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000218</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_tx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_tx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_8_REG</name>
          <addressOffset>0x0000050e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000234</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CNTRL_TIMER_9_REG</name>
          <addressOffset>0x00000510</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000239</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_OFFSET</name>
              <description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_OFFSET</name>
              <description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CP_CTRL_REG</name>
          <addressOffset>0x00000c50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000ffff</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>CP_CUR_TX</name>
              <description>CP current setting during PLL - Lock in TX mode
1111: 45 &#xB5;A (fastest, setting 0)
0111: 15 &#xB5;A (setting 1)
0011: 7.5 &#xB5;A (setting 2)
0001: 3.75 &#xB5;A (slowest, setting 3)
Intermediate values are possible (but not recommended). Calculate the effective value with:
bit 0: 3.75 &#xB5;A
bit 1: 3.75 &#xB5;A
bit 2: 7.5 &#xB5;A
bit 3: 30 &#xB5;A </description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP_CUR_RX</name>
              <description>CP current setting during PLL - lock in RX mode
same coding as for CP_CUR_TX </description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP_CUR_SET_TX</name>
              <description>Chargepump current setting during PLL settling in TX mode
same coding as for CP_CUR_TX </description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP_CUR_SET_RX</name>
              <description>Chargepump current setting during PLL settling in RX mode.
same coding as for CP_CUR_TX</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DC_OFFSET_CTRL1_REG</name>
          <addressOffset>0x00000866</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00008080</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>DCOFFSET_Q_WR</name>
              <description>DC offset compensation value in Q channel valid when DCOFFSET_SEL = 1 </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOFFSET_I_WR</name>
              <description>DC offset compensation value in I channel valid when DCOFFSET_SEL = 1 </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DC_OFFSET_CTRL2_REG</name>
          <addressOffset>0x00000868</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000130</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>DCNGAIN</name>
              <description>Number of gain settings for the full DC offset calibration </description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCNSTEP</name>
              <description>Number of the steps per.gain setting for the full or partial DC offset calibrations </description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCPOLE</name>
              <description>Selects the pole of the digital high pass fitlers
Encoding: TBD </description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCPARCAL_EN</name>
              <description>Enable flag for the partial DC offset calibration (executed when the demodulator is enabled). </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOFFSET_SEL</name>
              <description>'0': Normal operation
'1': Use the manual DC offset compensation values from RF_DC_OFFSET_CTRL1_REG </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DC_OFFSET_CTRL3_REG</name>
          <addressOffset>0x0000086a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000b411</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>DCBETA_Q</name>
              <description>Quadrature feedback gain for the DC offset calibration </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCBETA_I</name>
              <description>Inphase feedback gain for the DC offset calibration </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DC_OFFSET_CTRL4_REG</name>
          <addressOffset>0x0000086c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00009920</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>DCAGCSETTING_FULL3</name>
              <description>AGC setting for forth last the gain step for the full DC offset calibration </description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCAGCSETTING_FULL2</name>
              <description>AGC setting for third last the gain step for the full DC offset calibration </description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCAGCSETTING_FULL1</name>
              <description>AGC setting for second last the gain step for the full DC offset calibration </description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCAGCSETTING_FULL0</name>
              <description>AGC setting for last the gain step for the full DC offset calibration </description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DC_OFFSET_RESULT_REG</name>
          <description>Must be Retained</description>
          <addressOffset>0x00000314</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>DCOFFSET_Q_RD</name>
              <description>DC offset compensation value in Q channel valid when DCOFFSET_SEL = 0 </description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCOFFSET_I_RD</name>
              <description>DC offset compensation value in I channel valid when DCOFFSET_SEL = 0. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DEM_CTRL_REG</name>
          <addressOffset>0x00000840</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000058</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>EQUAL_EN</name>
              <description>Enable the equalizer in the demodulator </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH0101_TH</name>
              <description>Threshold for the 0101 pattern matching </description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEM_HSI_POL</name>
              <description>Invert 'frequency' polarity of the demodulator </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDATA_INV</name>
              <description>'0': Normal operation
'1': Invert the polarity of the received bits </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG10_REG</name>
          <addressOffset>0x00000412</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000433</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>adc_en</name>
              <description>Timing configuration for enable of the ADC </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vco_en</name>
              <description>Timing configuration for enable of the VCO </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
