nguyentri/da-pac/svd/DA14586.svd
        <register>
          <name>RF_ENABLE_CONFIG11_REG</name>
          <addressOffset>0x00000414</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00003333</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>md_lobuf_en</name>
              <description>Timing configuration for enable of main divider of the LO buffer</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cp_en</name>
              <description>Timing configuration for enable of CP </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG12_REG</name>
          <addressOffset>0x00000416</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00003330</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>pfd_en</name>
              <description>Timing configuration for the phase frequency detector </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gauss_en</name>
              <description>Timing configuration for the gauss module </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG13_REG</name>
          <addressOffset>0x00000418</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00009030</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>rfio_en</name>
              <description>Timing configuration for the rfio </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lobuf_pa_en</name>
              <description>Timing configuration for the PA lobuffer </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG14_REG</name>
          <addressOffset>0x0000041a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000333</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>lobuf_rxiq_en</name>
              <description>Timing configuration for the rxi lobuffer </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>div2_en</name>
              <description>Timing configuration for the 2 divider</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG15_REG</name>
          <addressOffset>0x0000041c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00005555</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>cp_bias_sh_open</name>
              <description>Timing configuration for the CP bias S/H switch </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vco_bias_sh_open_en</name>
              <description>Timing configuration for the VCO bias S/H switch </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG16_REG</name>
          <addressOffset>0x0000041e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000650</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>iff_bias_sh_open_en</name>
              <description>Timing configuration for iffmix bias S/H switch </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gauss_bias_sh_open_en</name>
              <description>Timing configuration for gauss bias S/H switch </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG17_REG</name>
          <addressOffset>0x00000420</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000633</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>mix_bias_sh_open_en</name>
              <description>Timing configuration for pa bias S/H switch </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>plldig_en</name>
              <description>Timing configuration for the plldig </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG18_REG</name>
          <addressOffset>0x00000422</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00007708</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>pllclosed_en</name>
              <description>Timing configuration for pllclosed </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dem_en</name>
              <description>Timing configuration for demodulator </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG19_REG</name>
          <addressOffset>0x00000424</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00001100</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>ldo_zero_en</name>
              <description>Timing configuration for radio LDO auto zero enable </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cal_en</name>
              <description>Timing configuration for calibration slot </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG1_REG</name>
          <addressOffset>0x00000400</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000209</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>lna_ldo_en</name>
              <description>Timing configuration for enable of the lna ldo </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lna_core_en</name>
              <description>Timing configuration for enable of the lna core </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG20_REG</name>
          <addressOffset>0x00000426</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000022</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>tdc_en</name>
              <description>Timing configuration for time to digital converter </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ldo_rfio_en</name>
              <description>Timing configuration for RFIO LDO </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG21_REG</name>
          <addressOffset>0x00000428</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000a0b0</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>rfio_bias_en</name>
              <description>Timing configuration for bias block for RFIO and RFPA </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rfio_bias_sh_open</name>
              <description>Timing configuration for S/H switch of bias block for RFIO/RFPA </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG22_REG</name>
          <addressOffset>0x0000042a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00002208</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>ldo_radio_en</name>
              <description>Timing configuration for LDO for the radio IO buffer </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_clk_en</name>
              <description>Timing configuration for the enable of the ADC clock</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG23_REG</name>
          <addressOffset>0x0000042c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>tr_pwm_off_en</name>
              <description>Timing configuration for tr_pwm_off_en </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spare_en_3</name>
              <description>Timing configuration for spare_en_3</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG2_REG</name>
          <addressOffset>0x00000402</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000122</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>lna_cgm_en</name>
              <description>Timing configuration for enable of the lna cgm </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mix_ldo_en</name>
              <description>Timing configuration for enable of the mix ldo </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG3_REG</name>
          <addressOffset>0x00000404</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00002204</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>iff_ldo_en</name>
              <description>Timing configuration for enable of the iff ldo </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ifadc_ldo_en</name>
              <description>Timing configuration for enable of the ifadc ldo </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG4_REG</name>
          <addressOffset>0x00000406</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00002222</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>vco_ldo_en</name>
              <description>Timing configuration for enable of the vco ldo </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>md_ldo_en</name>
              <description>Timing configuration for enable of the md ldo </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG5_REG</name>
          <addressOffset>0x00000408</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00002222</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>pfd_ldo_en</name>
              <description>Timing configuration for enable of the pfd ldo </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pa_ldo_en</name>
              <description>Timing configuration for enable of the pa ldo </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG6_REG</name>
          <addressOffset>0x0000040a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000433</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>cp_switch_en</name>
              <description>Timing configuration for the dynamic CP current switching</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vco_bias_en</name>
              <description>Timing configuration for the VCO bias </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG7_REG</name>
          <addressOffset>0x0000040c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00003300</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>cp_bias_en</name>
              <description>Timing configuration for enable of the CP bias </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lna_ldo_zero</name>
              <description>autozero control signal of the lna ldo</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG8_REG</name>
          <addressOffset>0x0000040e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000c0a0</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>pa_ramp_en</name>
              <description>Timing configuration for enable of the PA ramp </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pa_en</name>
              <description>Timing configuration for enable of the PA </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_ENABLE_CONFIG9_REG</name>
          <addressOffset>0x00000410</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000404</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>mix_en</name>
              <description>Timing configuration for enable of the mixer </description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iff_en</name>
              <description>Timing configuration for enable of the iff </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_IFF_CTRL1_REG</name>
          <addressOffset>0x00000820</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000000c</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>IFF_DCOC_DAC_DIS</name>
              <description>Disable the DC offset current DAC </description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RO_TO_PINS</name>
              <description>'0': normal operation;
'1': Enable reference oscillator. </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_MUTE</name>
              <description>'0': normal operation;
'1': Mute IFF by short circuit of VGA1 input.
Note: set TGATE_MIXER_IF to '0' for isolation from the IRM </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_CAL_CAP_SEL</name>
              <description>'0': use value as determined by IF calibration for IF filter;
'1': use the value written to IF_CAL_CAP for IF filter. </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_CAL_CAP_WR</name>
              <description>External value for IF calibration capacitance </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_IFF_RESULT_REG</name>
          <description>Must be Retained</description>
          <addressOffset>0x00000300</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>IF_CAL_CAP_RD</name>
              <description>IF calibration result capacitance. </description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_IRQ_CTRL_REG</name>
          <addressOffset>0x00000204</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>EO_CAL_CLEAR</name>
              <description>Writing any value to this bit clears eo_cal interrupt. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_LF_CTRL_REG</name>
          <addressOffset>0x00000c60</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000000c</resetValue>
          <resetMask>0x0000ff7f</resetMask>
          <fields>
            <field>
              <name>LF_SHORT_R4</name>
              <description>'0': R4 in place, '1': R4 shorted, C2 and C4 in parallel. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LF_CAL_CAP_SEL</name>
              <description>'0': Normal operation: use IF_CAL_CAP_RD (as determined by IF calibration) for the loop filter capacitance;
'1': use the value written to LF_CAL_CAP_WR </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LF_CAL_CAP_WR</name>
              <description>External value for loop filter calibration capacitance </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_LF_RES_CTRL_REG</name>
          <description>LF resistor setting</description>
          <addressOffset>0x00000c52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000ffff</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>LF_RES_TX</name>
              <description>Loopfilter resistor setting during PLL - Lock in TX mode
1xxx: 72 k (fastest, setting 0)
01xx: 120 k (setting 1)
001x: 168 k (setting2)
000x: 240 k (slowest, setting 3) </description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LF_RES_RX</name>
              <description>Loopfilter resistor setting during PLL - Lock in RX mode
same coding as for LF_RES_TX </description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LF_RES_SET_TX</name>
              <description>Loopfilter resistor setting during PLL settling in TX mode

