nguyentri/da-pac/svd/DA14586.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>rfpt580_gr01</name>
      <version>1.0</version>
      <description>rfpt580_gr01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50003500</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RFPT_ADDR_REG</name>
          <description>AHB master start address</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RFPT_ADDR</name>
              <description>It is the AHB address used by the AHB-Lite master interface of the controller (the bits [15:2]). </description>
              <bitRange>[15:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFPT_CTRL_REG</name>
          <description>Control register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RFPT_PACK_SEL</name>
              <description>Selects the source of data that will be captured.
0 - Will capture the output of the two ADC.
1 - Will capture the output of the Phase Detector. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFPT_PACK_EN</name>
              <description>Starts the capturing of the data from the selected source (
RFPT_PACK_SEL
).
0 - There is no capturing of data. The packer of data is idle.
1 - The controller captures data. The packing of the data in words, is in progress.
Should be written with 1 in order to start the acquisition of data. After the acquisition of a predefined number of words (
RFPT_LEN
), this bit will be auto cleared. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFPT_LEN_REG</name>
          <description>Data length register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RFPT_LEN</name>
              <description>The number of words (minus one) that should be transfered.
When the selected source of data is the two ADC (
RFPT_PACK_SEL
==0), will capture 2*(
RFPT_LEN
+ 1) samples from each ADC. Otherwise (
RFPT_PACK_SEL
==1), will capture 4*(
RFPT_LEN
+ 1) samples from the Phase Detector. </description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFPT_STAT_REG</name>
          <description>Status register</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RFPT_OFLOW_STK</name>
              <description>Indicates that during the transfer of the data, at least one overflow has detected to the fifo.
0 - The transfer completed without overflows.
1 - At least one overflow occured in the fifo.
Write 1 to clear this bit. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFPT_ACTIVE</name>
              <description>Indicates the state of the controller.
0 - The controller is idle.
1 - The controller is active. The capturing process and/or the dma activity is in progress.
The controller will activated (RFPT_ACTIVE == 1), when RFPT_PACK_EN will be written with 1. Will return to inactive state, after the end of the capturing process (RFPT_PACK_EN==0) and the transfer of all of the data to the memory. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>riscutil580_gpreg_nl01</name>
      <version>1.0</version>
      <description>riscutil580_gpreg_nl01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50003300</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DEBUG_REG</name>
          <description>Various debug information register.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>DEBUGS_FREEZE_EN</name>
              <description>Default '1', freezing of the on-chip timers is enabled when the Cortex-M0 is halted in DEBUG State.
If '0', freezing of the on-chip timers is depending on FREEZE_REG when the Cortex-M0 is halted in DEBUG State except the watchdog timer. The watchdog timer is always frozen when the Cortex-M0 is halted in DEBUG State. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP_CONTROL_REG</name>
          <description>General purpose system control register.</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>EM_MAP</name>
              <description>Select the mapping of the Exchange memory pages.
0: EM size 0 kB, SysRAM size 42 kB
1: EM size 2 kB, SysRAM size 48 kB
2: EM size 3 kB, SysRAM size 47 kB
3: EM size 4 kB, SysRAM size 46 kB
4: EM size 5 kB, SysRAM size 45 kB
5: EM size 6 kB, SysRAM size 44 kB
6: EM size 7 kB, SysRAM size 43 kB
7: EM size 8 kB, SysRAM size 42 kB
8: Reserved
9: EM size 4 kB, SysRAM size 40 kB
10: EM size 5 kB, SysRAM size 40 kB
11: EM size 6 kB, SysRAM size 40 kB
12: EM size 7 kB, SysRAM size 40 kB
13: EM size 8 kB, SysRAM size 40 kB
14: EM size 9 kB, SysRAM size 40 kB
15: EM size 10 kB, SysRAM size 40 kB
16: Reserved
17: EM size 6 kB, SysRAM size 38 kB
18: EM size 7 kB, SysRAM size 38 kB
19: EM size 8 kB, SysRAM size 38 kB
20: EM size 9 kB, SysRAM size 38 kB
21: EM size 10 kB, SysRAM size 38 kB
22: EM size 11 kB, SysRAM size 38 kB
23: EM size 12 kB, SysRAM size 38 kB
other: Reserved. </description>
              <bitRange>[5:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_WAKEUP_REQ</name>
              <description>If '1', the BLE wakes up. Must be kept high at least for 1 low power clock period. 
If the BLE is in deep sleep state, then by setting this bit it will cause the wakeup LP IRQ to be asserted with a delay of 3 to 4 low power cycles.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP_STATUS_REG</name>
          <description>General purpose system status register.</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>CAL_PHASE</name>
              <description>If '1', it designates that the chip is in Calibration Phase i.e. the OTP has been initially programmed but no Calibration has occured. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET_FREEZE_REG</name>
          <description>Controls unfreezing of various timers/counters.</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>FRZ_WDOG</name>
              <description>If '1', the watchdog timer continues, '0' is discarded. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRZ_BLETIM</name>
              <description>If '1', the the BLE master clock continues, '0' is discarded. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRZ_SWTIM</name>
              <description>If '1', the SW Timer (TIMER0) continues, '0' is discarded. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRZ_WKUPTIM</name>
              <description>If '1', the Wake Up Timer continues, '0' is discarded. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_FREEZE_REG</name>
          <description>Controls freezing of various timers/counters.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>FRZ_WDOG</name>
              <description>If '1', the watchdog timer is frozen, '0' is discarded. WATCHDOG_CTRL_REG[NMI_RST] must be '0' to allow the freeze function. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRZ_BLETIM</name>
              <description>If '1', the BLE master clock is frozen, '0' is discarded. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRZ_SWTIM</name>
              <description>If '1', the SW Timer (TIMER0) is frozen, '0' is discarded. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRZ_WKUPTIM</name>
              <description>If '1', the Wake Up Timer is frozen, '0' is discarded. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
